როდესაც ვსაუბრობთ dictionary-ზე პროგრამირებაში, ეს არის კოლექცია, რომელიც შედგება key და value წყვილებისგან.

Key არის უნიკალური იდენტიფიკატორი, რომლის საშუალებითაც ჩვენ ვპოულობთ კონკრეტულ მნიშვნელობას value. Key-value pair არის მონაცემების კომპლექტი, სადაც key აკავშირებს კონკრეტულ value-ს.

ამით dictionary განსხვავდება სხვა კოლექციებისგან:

სიები (lists): აქ ელემენტები აქვთ პოზიცია (ინდექსი), და ჩვენ ვპოულობთ ელემენტს მისი ინდექსის მიხედვით.

მონაცემთა ჯგუფები (sets): აქ არის უნიკალური ელემენტების კრებული, და არ აქვთ არც ინდექსი და არც key-value სტრუქტურა.

ტაფლები (tuples): ისინი მსგავსია სიების, მაგრამ არის ფიქსირებული ზომით და არ შეგვიძლია მათი რედაქტირება (immutable).